In [2]:
import pandas as pd

In [5]:
pd.DataFrame({"Name" : ["Sam", "Stephen", "Nathan"], "Department" : ["DS", "CSE", "DS"]})

      Name Department
0      Sam         DS
1  Stephen        CSE
2   Nathan         DS

In [6]:
pd.DataFrame({"Name" : ["Sam", "Stephen", "Nathan"], "Department" : ["DS", "CSE", "DS"]}, index = ["E1", "E2", "E3"])

       Name Department
E1      Sam         DS
E2  Stephen        CSE
E3   Nathan         DS

In [8]:
pd.Series(["DS", "CSE", "DS"])

0     DS
1    CSE
2     DS
dtype: object

In [9]:
pd.Series(["DS", "CSE", "DS"], index = ["E1", "E2", "E3"])

E1     DS
E2    CSE
E3     DS
dtype: object

In [10]:
pd.Series(["DS", "CSE", "DS"], index = ["E1", "E2", "E3"], name = "Column 1")

E1     DS
E2    CSE
E3     DS
Name: Column 1, dtype: object

In [21]:
pd.read_csv("C:\Sample.csv")
sample = pd.read_csv("C:\Sample.csv")

     Name Department
0     Sam         DS
1    John        CSE
2    Cris        ISC
3  Johnny         DS
4     Ron         DS
5   Ginny         DS
6    Fred         DS

In [17]:
sample.shape

(7, 2)

In [18]:
sample.head()

     Name Department
0     Sam         DS
1    John        CSE
2    Cris        ISC
3  Johnny         DS
4     Ron         DS

In [40]:
sample = pd.read_csv("C:\Sample.csv", index_col = 0)
sample

     Name Department
0     Sam         DS
1    John        CSE
2    Cris        ISC
3  Johnny         DS
4     Ron         DS
5   Ginny         DS
6    Fred         DS

In [41]:
sample = pd.read_csv("C:\Sample.csv", index_col = 1)
sample

              Name
Department
DS             Sam
CSE           John
ISC           Cris
DS          Johnny
DS             Ron
DS           Ginny
DS            Fred

In [48]:
data = pd.DataFrame({"Name" : ["Sam", "Stephen", "Nathan"], "Department" : ["DS", "CSE", "DS"]})
data.to_csv("datastudent.csv")

In [50]:
pd.read_csv("datastudent.csv", index_col = 0)

      Name Department
0      Sam         DS
1  Stephen        CSE
2   Nathan         DS

In [51]:
data

      Name Department
0      Sam         DS
1  Stephen        CSE
2   Nathan         DS